Revit 2027 API
TransactionGroup.SetName Method
 Sets the transaction group's name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetName(
	string name
)
Public Sub SetName (
	name As String
)
public:
void SetName(
	String^ name
)
member SetName :
        name : string -> unit
Parameters
name String
 A name for the transaction group.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Transaction group only needs a name if it is going to be assimilated at the end.
See Also
Reference
TransactionGroup Class
Autodesk.Revit.DB Namespace